M-hafez98/FM33A0xxEV-MCU-Porting/Device/Include/FM33A0XXEV.h
/**************************************************************************************************** 
 * @file     FM33A0XXEV.h
 *
 * @brief    CMSIS CORTEX-M0 Peripheral Access Layer Header File for
 *           FM33A0XXEV from Keil.
 *
 * @version  V0.0.1
 * @date     7 May 2020
 *
 * @note     Generated with SVDConv V2.87e 
 *           from CMSIS SVD File 'FM33A0XXEV.SVD' Version 1.0,
 *
 * @par      ARM Limited (ARM) is supplying this software for use with Cortex-M
 *           processor based microcontroller, but can be equally used for other
 *           suitable processor architectures. This file can be freely distributed.
 *           Modifications to this file shall be clearly marked.
 *
 *           THIS SOFTWARE IS PROVIDED “AS IS”. NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 *           OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 *           MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 *           ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 *           CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 *******************************************************************************************************/


/** @addtogroup Keil
  * @{
  */

/** @addtogroup FM33A0XXEV
  * @{
  */

#ifndef FM33A0XXEV_H
#define FM33A0XXEV_H

#ifdef __cplusplus
extern "C" {
#endif

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;
typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunState;
typedef enum {FAIL = 0, PASS = !FAIL} ErrorStatus;

#define __RCHF_INITIAL_CLOCK        (8000000)        /* Value of the Internal RC HIGH oscillator in Hz */
#define __RCMF_CLOCK                (2000000)        /* Value of the Internal RC 4M oscillator in Hz */
#define __RCLP_CLOCK               (32000)          /* Value of the Internal RC LOW oscillator in Hz */
#define __XTLF_CLOCK                (32768)          /* Value of the EXTERNAL oscillator in Hz */


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {

/* ------------------  FM33A0XXEV Processor Exceptions Numbers  ------------------*/
  Reset_IRQn                    = -15,              /*!<   1  复位向量 */
  NMI_IRQn                      = -14,              /*!<   2  WKUPx中断低功耗模式错误中断 */
  HardFault_IRQn                = -13,              /*!<   3  HardFault中断向量 */
  SVC_IRQn                      = -5,               /*!<  11  SVCall系统服务请求 */
  PendSV_IRQn                   = -2,               /*!<  14  可挂起系统服务请求 */
  SysTick_IRQn                  = -1,               /*!<  15  内部定时器中断向量 */

/* --------------------  Cortex-M0 Specific Interrupt Numbers  --------------------*/
  WWDT_IRQn                     = 0,                /*!<   0  窗口看门狗中断 */
  SVD_IRQn                      = 1,                /*!<   1  电源监测报警中断 */
  RTC_IRQn                      = 2,                /*!<   2  RTC中断 */
  FLASH_IRQn                    = 3,                /*!<   3  NVMIF中断 */
  CMU_IRQn                      = 4,                /*!<   4  XTLF停振检测中断XTHF停振检测中断系统时钟切换错误中断 */
  ADC_IRQn                      = 5,                /*!<   5  ADC或CIC中断 */
  SPI0_IRQn                     = 6,                /*!<   6  SPI中断 */
  SPI1_IRQn                     = 7,                /*!<   7  SPI中断 */
  SPI2_IRQn                     = 8,                /*!<   8  SPI中断 */
  UART0_IRQn                    = 9,                /*!<   9  UART中断 */
  UART1_IRQn                    = 10,               /*!<  10  UART中断 */
  UART2_IRQn                    = 11,               /*!<  11  UART中断 */
  UART3_IRQn                    = 12,               /*!<  12  UART中断 */
  UART4_IRQn                    = 13,               /*!<  13  UART中断 */
  UART5_IRQn                    = 14,               /*!<  14  UART中断 */
  U7816_IRQn                    = 15,               /*!<  15  U7816中断 */
  LPUART0_IRQn                  = 16,               /*!<  16  低功耗UART中断 */
  I2Cx_IRQn                     = 17,               /*!<  17  I2C0&1中断 */
  RSV_IRQn                      = 18,               /*!<  18  NULL         */
  CRYPTO_IRQn                   = 19,               /*!<  19  加密算法或TRNG中断整合AES/PAE/HASH */
  LPTIM_IRQn                    = 20,               /*!<  20  低功耗定时器中断 */
  DMA_IRQn                      = 21,               /*!<  21  DMA中断 */
  WKUPx_IRQn                    = 22,               /*!<  22  WKUP引脚中断 */
  COMP_IRQn                     = 23,               /*!<  23  模拟比较器中断 */
  BTx_IRQn                      = 24,               /*!<  24  Basic Timer x中断 */
  QSPI_IRQn                     = 25,               /*!<  25  QuadSPI中断 */
  ETx_IRQn                      = 26,               /*!<  26  Extended Timer x中断 */
  BSTIM_IRQn                    = 27,               /*!<  27  基本定时器中断 */
  SPI3_IRQn                     = 28,               /*!<  28  SPI中断 */
  SPI4_IRQn                     = 29,               /*!<  29  SPI中断 */
  GPIO_IRQn                     = 30,               /*!<  30  外部引脚中断 */
  LPUART1_IRQn                  = 31,               /*!<  31  低功耗UART中断 */

} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the CORTEX-M0 Processor and Core Peripherals---------------- */
#define __CM0_REV                 0x0100            /*!< CORTEX-M0 Core Revision                                               */
#define __MPU_PRESENT                  1            /*!< MPU present or not                                                    */
#define __VTOR_PRESENT                 1           /*!< VTOR present or not                                                    */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0plus.h"                            /*!< Cortex-M0 processor and core peripherals*/
#include "system_FM33A0XXEV.h"                       /*!< FM33A0XXEV System*/

/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */

/** @addtogroup Device_Peripheral_Registers
  * @{
  */

/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
#warning Not supported compiler type
#endif


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  Power Management Control Register,                    Address offset: 0x00 */
  __IO uint32_t WKTR;                   /*!<  Wakeup Time Register,                                 Address offset: 0x04 */
  __IO uint32_t WKFR;                   /*!<  Wakeup Source Flags Register,                         Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  PMU Interrupt Enable Register,                        Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  PMU Interrupt and Status Register,                    Address offset: 0x10 */
}PMU_Type;


/* ================================================================================ */
/* ================                       DBG                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x00 */
  __IO uint32_t CR;                     /*!<  Debug Configuration Register,                         Address offset: 0x04 */
  __IO uint32_t HDFR;                   /*!<  HardFault Flag Register,                              Address offset: 0x08 */
}DBG_Type;


/* ================================================================================ */
/* ================                       FLS                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t RDCR;                   /*!<  Flash Read Control Register,                          Address offset: 0x00 */
  __IO uint32_t PFCR;                   /*!<  Flash Prefetch Control Register,                      Address offset: 0x04 */
  __I  uint32_t OPTBR;                  /*!<  Flash Option Bytes Register,                          Address offset: 0x08 */
  __IO uint32_t RSV1[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x0C */
  __IO uint32_t EPCR;                   /*!<  Flash Erase/Program Control Register,                 Address offset: 0x14 */
  __O  uint32_t KEY;                    /*!<  Flash Key Register,                                   Address offset: 0x18 */
  __IO uint32_t IER;                    /*!<  Flash Interrupt Enable Register,                      Address offset: 0x1C */
  __IO uint32_t ISR;                    /*!<  Flash Interrupt Status Register,                      Address offset: 0x20 */
  __IO uint32_t RSV2[9];                /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
  __IO uint32_t ACLOCK1;                /*!<  Flash Application Code Lock Register1,                Address offset: 0x48 */
  __IO uint32_t ACLOCK2;                /*!<  Flash Application Code Lock Register2,                Address offset: 0x4C */
  __IO uint32_t ACLOCK3;                /*!<  Flash Application Code Lock Register1,                Address offset: 0x50 */
  __IO uint32_t ACLOCK4;                /*!<  Flash Application Code Lock Register2,                Address offset: 0x54 */
}FLS_Type;


/* ================================================================================ */
/* ================                       RMU                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t PDRCR;                  /*!<  PDR Control Register,                                 Address offset: 0x00 */
  __IO uint32_t BORCR;                  /*!<  BOR Control Register,                                 Address offset: 0x04 */
  __IO uint32_t RSTCFGR;                /*!<  Reset Config Register,                                Address offset: 0x08 */
  __O  uint32_t SOFTRST;                /*!<  Soft Reset Register,                                  Address offset: 0x0C */
  __IO uint32_t RSR;                    /*!<  Reset Status Register,                                Address offset: 0x10 */
  __O  uint32_t PRSTEN;                 /*!<  Peripheral Reset Enable Register,                     Address offset: 0x14 */
  __IO uint32_t AHBRST;                 /*!<  AHB Peripheral Reset Register,                        Address offset: 0x18 */
  __IO uint32_t APBRST1;                /*!<  APB Peripheral Reset Register1,                       Address offset: 0x1C */
  __IO uint32_t APBRST2;                /*!<  APB Peripheral Reset Register2,                       Address offset: 0x20 */
}RMU_Type;


/* ================================================================================ */
/* ================                      IWDT                      ================ */
/* ================================================================================ */

typedef struct
{
  __O  uint32_t SERV;                   /*!<  IWDT Serve Register,                                  Address offset: 0x00 */
  __IO uint32_t CFGR;                   /*!<  IWDT Config Register,                                 Address offset: 0x04 */
  __I uint32_t CNTR;                   /*!<   Counter Register,                                    Address offset: 0x08 */
}IWDT_Type;


/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */

typedef struct
{
  __O  uint32_t CR;                     /*!<  WWDT Control Register,                                Address offset: 0x00 */
  __IO uint32_t CFGR;                   /*!<  WWDT Config Register,                                 Address offset: 0x04 */
  __I  uint32_t CNTR;                   /*!<  WWDT Counter Register,                                Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  WWDT Interrupt Enable Register,                       Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  WWDT Interrupt Status Register,                       Address offset: 0x10 */
  __I  uint32_t PSCR;                   /*!<  WWDT Prescaler Register,                              Address offset: 0x14 */
}WWDT_Type;


/* ================================================================================ */
/* ================                      CMU                          ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t SYSCLKCR;               /*!<  System Clock Control Register,                        Address offset: 0x00 */
  __IO uint32_t RCHFCR;                 /*!<  RCHF Control Register,                                Address offset: 0x04 */
  __IO uint32_t RCHFTR;                 /*!<  RCHF Trim Register,                                   Address offset: 0x08 */
  __IO uint32_t PLLLCR;                 /*!<  PLL_L Control Register,                               Address offset: 0x0C */
  __IO uint32_t PLLHCR;                 /*!<  PLL_H Control Register,                               Address offset: 0x10 */
  __IO uint32_t XTHFCR;                 /*!<  XTHF Control Register,                                Address offset: 0x14 */
  __IO uint32_t IER;                    /*!<  Interrupt Enable Register,                            Address offset: 0x18 */
  __IO uint32_t ISR;                    /*!<  Interrupt Status Register,                            Address offset: 0x1C */
  __IO uint32_t PCLKCR1;                /*!<  Peripheral bus Clock Control Register1,               Address offset: 0x20 */
  __IO uint32_t PCLKCR2;                /*!<  Peripheral bus Clock Control Register2,               Address offset: 0x24 */
  __IO uint32_t PCLKCR3;                /*!<  Peripheral bus Clock Control Register3,               Address offset: 0x28 */
  __IO uint32_t PCLKCR4;                /*!<  Peripheral bus Clock Control Register4,               Address offset: 0x2C */
  __IO uint32_t OPCCR1;                 /*!<  Peripheral Operation Clock Control Register1,         Address offset: 0x30 */
  __IO uint32_t OPCCR2;                 /*!<  Peripheral Operation Clock Control Register2,         Address offset: 0x34 */
}CMU_Type;

/* ================================================================================ */
/* ================                      CDIF                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  CDIF Control Register,                                Address offset: 0x00 */
  __IO uint32_t PSCR;                   /*!<  CDIF Prescaler Register,                              Address offset: 0x04 */
}CDIF_Type;


/* ================================================================================ */
/* ================                      VRTC                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t PDRCR;                /*!<  RESERVED REGISTER,                                      Address offset: 0x00 */
  __IO uint32_t RSV1[4];                /*!<  RESERVED REGISTER,                                    Address offset: 0x04 */
  __IO uint32_t RCMFCR;                 /*!<  RCMF Control Register,                                Address offset: 0x14 */
  __IO uint32_t RCLPCR;                 /*!<  RCLP Control Register,                                Address offset: 0x18 */
  __IO uint32_t RCLPTR;                 /*!<  RCLP Control Register,                                Address offset: 0x1C */
  __IO uint32_t XTLFCR;                 /*!<  XTLF Control Register,                                Address offset: 0x20 */
  __IO uint32_t ADCCR;                  /*!<  ADC Clock Control Register,                           Address offset: 0x24 */
  __IO uint32_t LFDIER;                 /*!<  LFDET Interrupt Enable Register,                      Address offset: 0x28 */
  __IO uint32_t LFDISR;                 /*!<  LFDET Interrupt Status Register,                      Address offset: 0x2C */
}VRTC_Type;


/* ================================================================================ */
/* ================                       SVD                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CFGR;                   /*!<  SVD Config Register,                                  Address offset: 0x00 */
  __IO uint32_t CR;                     /*!<  SVD Control Register,                                 Address offset: 0x04 */
  __IO uint32_t IER;                    /*!<  SVD Interrupt Enable Register,                        Address offset: 0x08 */
  __IO uint32_t ISR;                    /*!<  SVD Interrupt Status Register,                        Address offset: 0x0C */
  __IO uint32_t VSR;                    /*!<  SVD reference Voltage Select Register,                Address offset: 0x10 */
}SVD_Type;


/* ================================================================================ */
/* ================                       AES                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  AES Control Register,                                 Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  AES Interrupt Enable Register,                        Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<   Interrupt Status Register,                           Address offset: 0x08 */
  __IO uint32_t DIR;                    /*!<  AES Data Input Register,                              Address offset: 0x0C */
  __I  uint32_t DOR;                    /*!<  AES Data Output Register,                             Address offset: 0x10 */
  __O  uint32_t KEY0;                   /*!<  AES Key Register 0,                                   Address offset: 0x14 */
  __O  uint32_t KEY1;                   /*!<  AES Key Register 1,                                   Address offset: 0x18 */
  __O  uint32_t KEY2;                   /*!<  AES Key Register 2,                                   Address offset: 0x1C */
  __O  uint32_t KEY3;                   /*!<  AES Key Register 3,                                   Address offset: 0x20 */
  __O  uint32_t KEY4;                   /*!<  AES Key Register 4,                                   Address offset: 0x24 */
  __O  uint32_t KEY5;                   /*!<  AES Key Register 5,                                   Address offset: 0x28 */
  __O  uint32_t KEY6;                   /*!<  AES Key Register 6,                                   Address offset: 0x2C */
  __O  uint32_t KEY7;                   /*!<  AES Key Register 7,                                   Address offset: 0x30 */
  __IO uint32_t IVR0;                   /*!<  AES Initial Vector Register 0,                        Address offset: 0x34 */
  __IO uint32_t IVR1;                   /*!<  AES Initial Vector Register 1,                        Address offset: 0x38 */
  __IO uint32_t IVR2;                   /*!<  AES Initial Vector Register 2,                        Address offset: 0x3C */
  __IO uint32_t IVR3;                   /*!<  AES Initial Vector Register 3,                        Address offset: 0x40 */
  __IO uint32_t H0;                     /*!<  AES MultH parameter Register 0,                       Address offset: 0x44 */
  __IO uint32_t H1;                     /*!<  AES MultH parameter Register 1,                       Address offset: 0x48 */
  __IO uint32_t H2;                     /*!<  AES MultH parameter Register 2,                       Address offset: 0x4C */
  __IO uint32_t H3;                     /*!<  AES MultH parameter Register 3,                       Address offset: 0x50 */
}AES_Type;


/* ================================================================================ */
/* ================                       PAE                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CSR;                    /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t MLR;                    /*!<  ,                                                     Address offset: 0x04 */
  __O  uint32_t MPR;                    /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t M0CFG;                  /*!<  ,                                                     Address offset: 0x0C */
  __IO uint32_t M1CFG;                  /*!<  ,                                                     Address offset: 0x10 */
  __IO uint32_t M2CFG;                  /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t M3CFG;                  /*!<  ,                                                     Address offset: 0x18 */
  __O  uint32_t WORD;                   /*!<  ,                                                     Address offset: 0x1C */
}PAE_Type;


/* ================================================================================ */
/* ================                     HASH                       ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CSR;                    /*!<  Hash Control and Status Register,                     Address offset: 0x00 */
  __IO uint32_t DTR;                    /*!<  Hash Data Type Register,                              Address offset: 0x04 */
}HASH_Type;


/* ================================================================================ */
/* ================                       RNG                      ================ */
/* ================================================================================ */

