M-hafez98/FM33A0xxEV-MCU-Porting/Device/Include/FM33A0XXEV.h
typedef struct
{
  __IO uint32_t CR;                     /*!<  Random Number Generator Control Register,             Address offset: 0x00 */
  __I  uint32_t DOR;                    /*!<  Random Number Generator Data Output Register,         Address offset: 0x04 */
  __IO uint32_t RSV1[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x08 */
  __IO uint32_t SR;                     /*!<  Random Number Generator Status Register,              Address offset: 0x10 */
  __IO uint32_t CRC_CR;                 /*!<  CRC Control Register,                                 Address offset: 0x14 */
  __IO uint32_t CRC_DIR;                /*!<  CRC Data input Register,                              Address offset: 0x18 */
  __IO uint32_t CRC_SR;                 /*!<  CRC Status Register,                                  Address offset: 0x1C */
}RNG_Type;


/* ================================================================================ */
/* ================                      COMP                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t ICR;                    /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t ISR;                    /*!<  ,                                                     Address offset: 0x0C */
  __IO uint32_t PCR;                    /*!<  ,                                                     Address offset: 0x010 */ 
}COMP_Type;


/* ================================================================================ */
/* ================                      I2C                       ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CFGR;               /*!<  I2C Master Config Register,                           Address offset: 0x00 */
  __IO uint32_t CR;                 /*!<  I2C Master Control Register,                          Address offset: 0x04 */
  __IO uint32_t IER;                /*!<  I2C Master Interrupt Enable Register,                 Address offset: 0x08 */
  __IO uint32_t ISR;                /*!<  I2C Master Interrupt Status Register,                 Address offset: 0x0C */
  __IO uint32_t SR;                 /*!<  I2C Master Status Register,                           Address offset: 0x10 */
  __IO uint32_t BRG;                /*!<  I2C Master Baud Rate Generation Register,             Address offset: 0x14 */
  __IO uint32_t BUF;                /*!<  I2C Master Buffer Register,                           Address offset: 0x18 */
  __IO uint32_t TIMING;             /*!<  I2C Master Timing Register,                           Address offset: 0x1C */
  __IO uint32_t TO;                 /*!<  I2C Master Time-Out Register,                         Address offset: 0x20 */
}I2C_Type;


/* ================================================================================ */
/* ================                      UARTIR                    ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                   /*!<  Infrared modulation Control Register,                 Address offset: 0x00 */
}UARTIR_Type;


/* ================================================================================ */
/* ================                      UART                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CSR;                    /*!<  UARTx Control Status Register,                        Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  UARTx Interrupt Enable Register,                      Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  UARTx Interrupt Status Register,                      Address offset: 0x08 */
  __IO uint32_t TODR;                   /*!<  UARTx Time-Out and Delay Register,                    Address offset: 0x0C */
  __I  uint32_t RXBUF;                  /*!<  UARTx Receive Buffer,                                 Address offset: 0x10 */
  __IO uint32_t TXBUF;                  /*!<  UARTx Transmit Buffer,                                Address offset: 0x14 */
  __IO uint32_t BGR;                    /*!<  UARTx Baud rate Generator Register,                   Address offset: 0x18 */
}UART_Type;


/* ================================================================================ */
/* ================                       LPUART                   ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CSR;                    /*!<   Control Status Register,                             Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<   Interrupt Enable Register,                           Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<   Interrupt Status Register,                           Address offset: 0x08 */
  __IO uint32_t BMR;                    /*!<   Baud rate Modulation Register,                       Address offset: 0x0C */
  __IO uint32_t RXBUF;                  /*!<   Receive Buffer Register,                             Address offset: 0x10 */
  __IO uint32_t TXBUF;                  /*!<   Transmit Buffer Register,                            Address offset: 0x14 */
  __IO uint32_t DMR;                    /*!<   data Matching Register,                              Address offset: 0x18 */
}LPUART_Type;


/* ================================================================================ */
/* ================                      SPI                       ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  SPIx Control Register1,                               Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  SPIx Control Register2,                               Address offset: 0x04 */
  __O  uint32_t CR3;                    /*!<  SPIx Control Register3,                               Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  SPIx Interrupt Enable Register,                       Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  SPIx Status Register,                                 Address offset: 0x10 */
  __O  uint32_t TXBUF;                  /*!<  SPIx Transmit Buffer,                                 Address offset: 0x14 */
  __I  uint32_t RXBUF;                  /*!<  SPIx Receive Buffer,                                  Address offset: 0x18 */
}SPI_Type;


/* ================================================================================ */
/* ================                      U7816                     ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  U7816 Control Register,                               Address offset: 0x00 */
  __IO uint32_t FFR;                    /*!<  U7816 Frame Format Register,                          Address offset: 0x04 */
  __IO uint32_t EGTR;                   /*!<  U7816 Extra Guard Time Register,                      Address offset: 0x08 */
  __IO uint32_t PSC;                    /*!<  U7816 Prescaler Register,                             Address offset: 0x0C */
  __IO uint32_t BGR;                    /*!<  U7816 Baud rate Generator Register,                   Address offset: 0x10 */
  __I  uint32_t RXBUF;                  /*!<  U7816 Receive Buffer,                                 Address offset: 0x14 */
  __O  uint32_t TXBUF;                  /*!<  U7816 Transmit Buffer,                                Address offset: 0x18 */
  __IO uint32_t IER;                    /*!<  U7816 Interrupt Enable Register,                      Address offset: 0x1C */
  __IO uint32_t ISR;                    /*!<  U7816 Interrupt Status Register,                      Address offset: 0x20 */
}U7816_Type;


/* ================================================================================ */
/* ================                      QSPI                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  QSPI Control Register,                                Address offset: 0x00 */
  __IO uint32_t CFG;                    /*!<   Config Register,                                     Address offset: 0x04 */
  __IO uint32_t SR;                     /*!<  QSPI Status Register,                                 Address offset: 0x08 */
  __IO uint32_t DATALEN;                /*!<  QSPI Data Length Register,                            Address offset: 0x0C */
  __IO uint32_t CCR;                    /*!<  QSPI Communication Config Register,                   Address offset: 0x10 */
  __IO uint32_t ADDR;                   /*!<  QSPI Address Register,                                Address offset: 0x14 */
  __IO uint32_t ABR;                    /*!<  QSPI Alternate Bytes Register,                        Address offset: 0x18 */
  __IO uint32_t DR;                     /*!<  QSPI Data Register,                                   Address offset: 0x1C */
  __IO uint32_t SMSK;                   /*!<  QSPI Status Mask Register,                            Address offset: 0x20 */
  __IO uint32_t SMAT;                   /*!<  QSPI Status Match Register,                           Address offset: 0x24 */
  __IO uint32_t PITV;                   /*!<  QSPI Polling Interval Register,                       Address offset: 0x28 */
  __IO uint32_t TO;                     /*!<  QSPI Time Out Register,                               Address offset: 0x2C */
}QSPI_Type;


/* ================================================================================ */
/* ================                       DMA                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t GCR;                    /*!<   Global Control Register,                             Address offset: 0x00 */
  __IO uint32_t CH0CR;                  /*!<  Channel 0 Control Register,                           Address offset: 0x04 */
  __IO uint32_t CH0MAR;                 /*!<  Channel 0 Memory Address Register,                    Address offset: 0x08 */
  __IO uint32_t CH1CR;                  /*!<  Channel 1 Control Register,                           Address offset: 0x0C */
  __IO uint32_t CH1MAR;                 /*!<  Channel 1 Memory Address Register,                    Address offset: 0x10 */
  __IO uint32_t CH2CR;                  /*!<  Channel 2 Control Register,                           Address offset: 0x14 */
  __IO uint32_t CH2MAR;                 /*!<  Channel 2 Memory Address Register,                    Address offset: 0x18 */
  __IO uint32_t CH3CR;                  /*!<  Channel 3 Control Register,                           Address offset: 0x1C */
  __IO uint32_t CH3MAR;                 /*!<  Channel 3 Memory Address Register,                    Address offset: 0x20 */
  __IO uint32_t CH4CR;                  /*!<  Channel 4 Control Register,                           Address offset: 0x24 */
  __IO uint32_t CH4MAR;                 /*!<  Channel 4 Memory Address Register,                    Address offset: 0x28 */
  __IO uint32_t CH5CR;                  /*!<  Channel 5 Control Register,                           Address offset: 0x2C */
  __IO uint32_t CH5MAR;                 /*!<  Channel 5 Memory Address Register,                    Address offset: 0x30 */
  __IO uint32_t CH6CR;                  /*!<  Channel 6 Control Register,                           Address offset: 0x34 */
  __IO uint32_t CH6MAR;                 /*!<  Channel 6 Memory Address Register,                    Address offset: 0x38 */
  __IO uint32_t CH7CR;                  /*!<  Channel 7 Control Register,                           Address offset: 0x3C */
  __IO uint32_t CH7MAR;                 /*!<  Channel 7 Memory Address Register,                    Address offset: 0x40 */
  __IO uint32_t CH8CR;                  /*!<  Channel 8 Control Register,                           Address offset: 0x44 */
  __IO uint32_t CH8MAR;                 /*!<  Channel 8 Memory Address Register,                    Address offset: 0x48 */
  __IO uint32_t CH9CR;                  /*!<  Channel 9 Control Register,                           Address offset: 0x4C */
  __IO uint32_t CH9MAR;                 /*!<  Channel 9 Memory Address Register,                    Address offset: 0x50 */
  __IO uint32_t CH10CR;                 /*!<  Channel 10 Control Register,                          Address offset: 0x54 */
  __IO uint32_t CH10MAR;                /*!<  Channel 10 Memory Address Register,                   Address offset: 0x58 */
  __IO uint32_t CH11CR;                 /*!<  Channel 11 Control Register,                          Address offset: 0x5C */
  __IO uint32_t CH11FAR;                /*!<  Channel 11 Flash Address Register,                    Address offset: 0x60 */
  __IO uint32_t CH11RAR;                /*!<  Channel 11 RAM Address Register,                      Address offset: 0x64 */
  __IO uint32_t ISR;                    /*!<  DMA Interrupt Status Register,                        Address offset: 0x68 */
  __IO uint32_t RSV1[37];               /*!<  RESERVED REGISTER,                                    Address offset: 0x6C */
  __IO uint32_t CH0CSR;                 /*!<  Channel 0 Control Shadow Register,                    Address offset: 0x100 */
  __IO uint32_t CH0MASR;                /*!<  Channel 0 Memory Address Shadow Register,             Address offset: 0x104 */
  __IO uint32_t CH1CSR;                 /*!<  Channel 0 Control Shadow Register,                    Address offset: 0x108 */
  __IO uint32_t CH1MASR;                /*!<  Channel 0 Memory Address Shadow Register,             Address offset: 0x10C */
  __IO uint32_t CH2CSR;                 /*!<  Channel 0 Control Shadow Register,                    Address offset: 0x110 */
  __IO uint32_t CH2MASR;                /*!<  Channel 0 Memory Address Shadow Register,             Address offset: 0x114 */
  __IO uint32_t CH3CSR;                 /*!<  Channel 0 Control Shadow Register,                    Address offset: 0x118 */
  __IO uint32_t CH3MASR;                /*!<  Channel 0 Memory Address Shadow Register,             Address offset: 0x11C */
  __IO uint32_t CH4CSR;                 /*!<  Channel 0 Control Shadow Register,                    Address offset: 0x120 */
  __IO uint32_t CH4MASR;                /*!<  Channel 0 Memory Address Shadow Register,             Address offset: 0x124 */
  __IO uint32_t CH5CSR;                 /*!<  Channel 0 Control Shadow Register,                    Address offset: 0x128 */
  __IO uint32_t CH5MASR;                /*!<  Channel 0 Memory Address Shadow Register,             Address offset: 0x12C */
  __IO uint32_t CH6CSR;                 /*!<  Channel 0 Control Shadow Register,                    Address offset: 0x130 */
  __IO uint32_t CH6MASR;                /*!<  Channel 0 Memory Address Shadow Register,             Address offset: 0x134 */
}DMA_Type;


/* ================================================================================ */
/* ================                       CRC                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t DR;                     /*!<  CRC Data Register,                                    Address offset: 0x00 */
  __IO uint32_t CR;                     /*!<  CRC Control Register,                                 Address offset: 0x04 */
  __IO uint32_t LFSR;                    /*!<                     Address offset: 0x08 */
  __IO uint32_t XOR;                    /*!<                                Address offset: 0x0C */
  __IO uint32_t RSV1[3];
  __IO uint32_t POLY;                   /*!<  CRC Polynominal Register,                             Address offset: 0x1C */
}CRC_Type;


/* ================================================================================ */
/* ================                       BT                       ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  Basic Timer 1 Control Register 1,                     Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  Basic Timer 1 Control Register 2,                     Address offset: 0x04 */
  __IO uint32_t CFGR1;                  /*!<  Basic Timer 1 Config Register 1,                      Address offset: 0x08 */
  __IO uint32_t CFGR2;                  /*!<  Basic Timer 1 Config Register 2,                      Address offset: 0x0C */
  __IO uint32_t PRES;                   /*!<  Basic Timer 1 Prescaler Register,                     Address offset: 0x10 */
  __IO uint32_t LOADCR;                 /*!<  Basic Timer 1 Load Control Register,                  Address offset: 0x14 */
  __I  uint32_t CNTL;                   /*!<  Basic Timer 1 Counter Low,                            Address offset: 0x18 */
  __I  uint32_t CNTH;                   /*!<  Basic Timer 1 Counter High,                           Address offset: 0x1C */
  __IO uint32_t PRESET;                 /*!<  Basic Timer 1 Preset Register,                        Address offset: 0x20 */
  __IO uint32_t LOADL;                  /*!<  Basic Timer 1 Load Register Low,                      Address offset: 0x24 */
  __IO uint32_t LOADH;                  /*!<  Basic Timer 1 Load Register High,                     Address offset: 0x28 */
  __IO uint32_t CMPL ;                  /*!<  Basic Timer 1 Compare Register Low,                   Address offset: 0x2C */
  __IO uint32_t CMPH ;                  /*!<  Basic Timer 1 Compare Register High,                  Address offset: 0x30 */
  __IO uint32_t OUTCNT;                 /*!<  Basic Timer 1 Output Counter,                         Address offset: 0x34 */
  __IO uint32_t OCR;                    /*!<  Basic Timer 1 Output Control Register,                Address offset: 0x38 */
  __IO uint32_t IER;                    /*!<  Basic Timer 1 Interrupt Enable Register,              Address offset: 0x3C */
  __IO uint32_t ISR;                    /*!<  Basic Timer 1 Interrupt Status Register,              Address offset: 0x40 */
}BT_Type;


/* ================================================================================ */
/* ================                       ET                       ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  ETx Control Register,                                 Address offset: 0x00 */
  __IO uint32_t INSR;                   /*!<  ETx Input Select Register,                            Address offset: 0x04 */
  __IO uint32_t PSCR1;                  /*!<  ETx Prescaler Register1,                              Address offset: 0x08 */
  __IO uint32_t PSCR2;                  /*!<  ETx Prescaler Register2,                              Address offset: 0x0C */
  __IO uint32_t IVR;                    /*!<  ETx Initial Value Register,                           Address offset: 0x10 */
  __IO uint32_t CMPR;                   /*!<  ETx Compare Register,                                 Address offset: 0x14 */
  __IO uint32_t IER;                    /*!<  ETx Interrupt Enable Register,                        Address offset: 0x18 */
  __IO uint32_t ISR;                    /*!<  ETx Interrupt Status Register,                        Address offset: 0x1C */
}ET_Type;

/* ================================================================================ */
/* ================                      ETIM EXTEND               ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CNT1;					/*!< ETIMER COUNTER,                  Address offset: 0x00 */ 
  __IO uint32_t CNT2;					/*!< ETIMER COUNTER,                  Address offset: 0x04 */ 
  __IO uint32_t CNT3;					/*!< ETIMER COUNTER,                  Address offset: 0x08 */ 
  __IO uint32_t CNT4;					/*!< ETIMER COUNTER,                  Address offset: 0x0C */ 
}ETCNT_Type;

/* ================================================================================ */
/* ================                      BSTIM                     ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  BSTIM Control Register1,                              Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  BSTIM Control Register2,                              Address offset: 0x04 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  BSTIM Interrupt Enable Register,                      Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  BSTIM Interrupt Status Register,                      Address offset: 0x10 */
  __O  uint32_t EGR;                    /*!<  BSTIM Event Generation Register,                      Address offset: 0x14 */
  __IO uint32_t RSV2[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x18 */
  __IO uint32_t CNTR;                   /*!<  BSTIM Counter Register,                               Address offset: 0x24 */
  __IO uint32_t PSCR;                   /*!<  BSTIM Prescaler Register,                             Address offset: 0x28 */
  __IO uint32_t ARR;                    /*!<  BSTIM Auto-Reload Register,                           Address offset: 0x2C */
}BSTIM_Type;


/* ================================================================================ */
/* ================                       LPTIM                    ================ */
/* ================================================================================ */

