M-hafez98/FM33A0xxEV-MCU-Porting/Device/Include/FM33A0XXEV.h
typedef struct
{
  __IO uint32_t CFGR;                   /*!<   LPTIM Config Register,                                Address offset: 0x00 */
  __I  uint32_t CNTR;                   /*!<   LPTIM Counter Register,                               Address offset: 0x04 */
  __IO uint32_t CCSR;                   /*!<   LPTIM Capture/Compare Control and Status Register,    Address offset: 0x08 */
  __IO uint32_t ARR;                    /*!<   LPTIM Auto-Reload Register,                           Address offset: 0x0C */
  __IO uint32_t IER;                    /*!<   LPTIM Interrupt Enable Register,                      Address offset: 0x10 */
  __IO uint32_t ISR;                    /*!<   LPTIM Interrupt Status Register,                      Address offset: 0x14 */
  __IO uint32_t CR;                     /*!<   LPTIM Control Register,                               Address offset: 0x18 */
  __IO uint32_t RSV1;                   /*!<   LPTIM RESERVED REGISTER,                              Address offset: 0x1C */
  __IO uint32_t CCR1;                   /*!<   LPTIM Capture/Compare Register1,                      Address offset: 0x20 */
  __IO uint32_t CCR2;                   /*!<   LPTIM Capture/Compare Register2,                      Address offset: 0x24 */
  __IO uint32_t CCR3;                   /*!<   LPTIM Capture/Compare Register3,                      Address offset: 0x28 */
  __IO uint32_t CCR4;                   /*!<   LPTIM Capture/Compare Register4,                      Address offset: 0x2C */
} LPTIM_Type;


/* ================================================================================ */
/* ================                      RTC                       ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t WER;                    /*!<  RTC Write Enable Register,                          Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  RTC Interrupt Enable Register,                      Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  RTC Interrupt Status Register,                      Address offset: 0x08 */
  __IO uint32_t BCDSEC;                 /*!<  RTC BCD time register,                              Address offset: 0x0C */
  __IO uint32_t BCDMIN;                 /*!<  RTC BCD time register,                              Address offset: 0x10 */
  __IO uint32_t BCDHOUR;                /*!<  RTC BCD time register,                              Address offset: 0x14 */
  __IO uint32_t BCDDATE;                /*!<  RTC BCD time register,                              Address offset: 0x18 */
  __IO uint32_t BCDWEEK;                /*!<  RTC BCD time register,                              Address offset: 0x1C */
  __IO uint32_t BCDMONTH;               /*!<  RTC BCD time register,                              Address offset: 0x20 */
  __IO uint32_t BCDYEAR;                /*!<  RTC BCD time register,                              Address offset: 0x24 */
  __IO uint32_t ALARM;                  /*!<  RTC Alarm Register,                                 Address offset: 0x28 */
  __IO uint32_t TMSEL;                  /*!<  RTC Time Mark Select,                               Address offset: 0x2C */
  __IO uint32_t ADJUST;                 /*!<  RTC time Adjust Register,                           Address offset: 0x30 */
  __IO uint32_t ADSIGN;                 /*!<  RTC time Adjust Sign Register,                      Address offset: 0x34 */
  __IO uint32_t VCAL;                   /*!<  RTC Virtual Calibration Register,                   Address offset: 0x38 */
  __IO uint32_t MSCNT;                  /*!<  RTC Milli-Second Register,                          Address offset: 0x3C */
  __IO uint32_t CALSTEP;                /*!<  RTC Calibration Step Register,                      Address offset: 0x40 */
  __I  uint32_t ADCNT;                  /*!<  RTC Adjust Counter Register,                        Address offset: 0x44 */
  __I  uint32_t SSR;                    /*!<  RTC Sub-Second Register,                            Address offset: 0x48 */
  __IO uint32_t SSA;                    /*!<  RTC Sub-Second Alarm Register,                      Address offset: 0x4C */
  __IO uint32_t DTR;                    /*!<  RTC Time Mark Duty Cycle Register,                  Address offset: 0x50 */
  __IO uint32_t RSV1[10];               /*!<  RESERVED REGISTER,                                  Address offset: 0x54 */
  __IO uint32_t CR;                     /*!<  RTC Control Register,                               Address offset: 0x7C */
}RTC_Type;

/* ================================================================================ */
/* ================                       LCD                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  LCD Control Register,                                 Address offset: 0x00 */
  __IO uint32_t TEST;                   /*!<  LCD test Register,                                    Address offset: 0x04 */
  __IO uint32_t FCR;                    /*!<  LCD Frequency Control Register,                       Address offset: 0x08 */
  __IO uint32_t FLKT;                   /*!<  LCD Flick Time Register,                              Address offset: 0x0C */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x10 */
  __IO uint32_t IER;                    /*!<  LCD Interrupt Enable Register,                        Address offset: 0x14 */
  __IO uint32_t ISR;                    /*!<  LCD Interrupt Status Register,                        Address offset: 0x18 */
  __IO uint32_t RSV2[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t DATA0;                  /*!<  data buffer registers 0,                              Address offset: 0x24 */
  __IO uint32_t DATA1;                  /*!<  data buffer registers 1,                              Address offset: 0x28 */
  __IO uint32_t DATA2;                  /*!<  data buffer registers 2,                              Address offset: 0x2C */
  __IO uint32_t DATA3;                  /*!<  data buffer registers 3,                              Address offset: 0x30 */
  __IO uint32_t DATA4;                  /*!<  data buffer registers 4,                              Address offset: 0x34 */
  __IO uint32_t DATA5;                  /*!<  data buffer registers 5,                              Address offset: 0x38 */
  __IO uint32_t DATA6;                  /*!<  data buffer registers 6,                              Address offset: 0x3C */
  __IO uint32_t DATA7;                  /*!<  data buffer registers 7,                              Address offset: 0x40 */
  __IO uint32_t DATA8;                  /*!<  data buffer registers 8,                              Address offset: 0x44 */
  __IO uint32_t DATA9;                  /*!<  data buffer registers 9,                              Address offset: 0x48 */
  __IO uint32_t RSV3[1];                /*!<  RESERVED REGISTER,                                    Address offset: 0x4C */
  __IO uint32_t COMEN;                  /*!<  LCD COM Enable Register,                              Address offset: 0x50 */
  __IO uint32_t SEGEN0;                 /*!<  LCD SEG Enable Register0,                             Address offset: 0x54 */
  __IO uint32_t SEGEN1;                 /*!<  LCD SEG Enable Register1,                             Address offset: 0x58 */
  __IO uint32_t BSTCR;                  /*!<  LCD Boost Control Register,                           Address offset: 0x5C */
}LCD_Type;


/* ================================================================================ */
/* ================                       ADC                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  ADC Control Register,                                 Address offset: 0x00 */
  __IO uint32_t TRIM;                   /*!<  ADC Trim Register,                                    Address offset: 0x04 */
  __I  uint32_t DR;                     /*!<  ADC Data Register,                                    Address offset: 0x08 */
  __IO uint32_t ISR;                    /*!<  ADC Interrupt Status Regsiter,                        Address offset: 0x0C */
  __IO uint32_t CFGR;                   /*!<  ADC Config Register,                                  Address offset: 0x10 */
}ADC_Type;


/* ================================================================================ */
/* ================                        CIC                   ================ */
/* ================================================================================ */

typedef struct
{
  __I  uint32_t DR;                 /*!<  CIC Output Data Register,                             Address offset: 0x00 */
  __IO uint32_t OS;                 /*!<  CIC Output Offset Register,                           Address offset: 0x04 */
  __I  uint32_t USDR;               /*!<  CIC Unsigned Data Register,                           Address offset: 0x08 */
  __IO uint32_t CR;                 /*!<  CIC Control Register,                                 Address offset: 0x0C */
  __IO uint32_t ISR;                /*!<  CIC Interrupt Status Register,                        Address offset: 0x10 */
}CIC_Type;


/* ================================================================================ */
/* ================                      GPIO                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t INEN;                   /*!<  GPIOx Input Enable Register,                          Address offset: 0x00 */
  __IO uint32_t PUEN;                   /*!<  GPIOx Pull-Up Enable Register,                        Address offset: 0x04 */
  __IO uint32_t ODEN;                   /*!<   Open-Drain Enable Register,                          Address offset: 0x08 */
  __IO uint32_t FCR;                    /*!<   Function Control Register,                           Address offset: 0x0C */
  __IO uint32_t DO;                     /*!<   Data Output Register,                                Address offset: 0x10 */
  __O uint32_t DSET;                    /*!<   Data Set Register,                                   Address offset: 0x14 */
  __O uint32_t DRST;                    /*!<   Data Reset Register,                                 Address offset: 0x18 */
  __I uint32_t DIN;                     /*!<   Data Input Register,                                 Address offset: 0x1C */
  __IO uint32_t DFS;                    /*!<   Digital Function Select,                             Address offset: 0x20 */
  __IO uint32_t RSV;                     /*!<  RESERVED REGISTER,                          Address offset: 0x24 */
  __IO uint32_t ANEN;                   /*!<  Analog channel Enable Register,                       Address offset: 0x28 */
}GPIO_Type;

/* ================================================================================ */
/* ================                      GPIOH                     ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t INEN;                   /*!<  GPIOx Input Enable Register,                          Address offset: 0x00 */
  __IO uint32_t PUEN;                   /*!<  GPIOx Pull-Up Enable Register,                        Address offset: 0x04 */
  __IO uint32_t FCR;                    /*!<   Function Control Register,                           Address offset: 0x08 */
  __IO uint32_t DO;                     /*!<   Data Output Register,                                Address offset: 0x0C */
  __IO uint32_t DIN;                    /*!<   Data Input Register,                                 Address offset: 0x10 */
}GPIOH_Type;

/* ================================================================================ */
/* ================                      GPIO                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t EXTISEL0;               /*!<  External Interrupt input Select Register1,            Address offset: 0x00 */
  __IO uint32_t EXTISEL1;               /*!<  External Interrupt input Select Register0,            Address offset: 0x04 */
  __IO uint32_t EXTIEDS0;               /*!<  External Interrupt Edge Select and Enable Register1,  Address offset: 0x08 */
  __IO uint32_t EXTIEDS1;               /*!<  External Interrupt Edge Select and Enable Register0,  Address offset: 0x0C */
  __IO uint32_t EXTIDF;                 /*!<  External Interrupt Digital Filter Register,           Address offset: 0x10 */
  __IO uint32_t EXTIISR;                /*!<  External Interrupt and Status Register,               Address offset: 0x14 */
  __I uint32_t EXTIDI;                  /*!<  External Interrupt Data Input Register,               Address offset: 0x18 */
  __IO uint32_t RSV1[9];                /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t FOUTSEL;                /*!<  Frequency Output Select Register,                     Address offset: 0x40 */
  __IO uint32_t IOMCR;                  /*!<  IO MUX Control Register,                              Address offset: 0x44 */
  __IO uint32_t RSV2[62];               /*!<  RESERVED REGISTER,                                    Address offset: 0x48 */
  __IO uint32_t PINWKEN;                /*!<  Wakeup Enable Register,                               Address offset: 0x140 */
}GPIO_COMMON_Type;

/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif


/* ================================================================================ */
/* ================              CPU memory map                    ================ */
/* ================================================================================ */


/* Peripheral and SRAM base address */

