M-hafez98/FM33A0xxEV-MCU-Porting/Device/Include/FM33A0XXEV.h
#define FLASH_BASE            ((     uint32_t)0x00000000)
#define SRAM_BASE             ((     uint32_t)0x20000000)
#define PERIPH_BASE           ((     uint32_t)0x40000000)


/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

/* Peripheral memory map */

#define PMU_BASE                        (PERIPH_BASE        +0x00002000)
#define DBG_BASE                        (PERIPH_BASE        +0x00000000)
#define FLS_BASE                        (PERIPH_BASE        +0x00001000)
#define RMU_BASE                        (PERIPH_BASE        +0x00002800)
#define IWDT_BASE                       (PERIPH_BASE        +0x00011400)
#define WWDT_BASE                       (PERIPH_BASE        +0x00011800)
#define CMU_BASE                        (PERIPH_BASE        +0x00002400)
#define CDIF_BASE                       (PERIPH_BASE        +0x0001E000)
#define VRTC_BASE                       (PERIPH_BASE        +0x0001F800)
#define SVD_BASE                        (PERIPH_BASE        +0x00012800)
#define AES_BASE                        (PERIPH_BASE        +0x00013800)
#define PAE_BASE                        (PERIPH_BASE        +0x00001400)
#define HASH_BASE                       (PERIPH_BASE        +0x00001800)
#define RNG_BASE                        (PERIPH_BASE        +0x00013C00)
#define COMP_BASE                       (PERIPH_BASE        +0x00015400)
#define I2C0_BASE                       (PERIPH_BASE        +0x00012400)
#define I2C1_BASE                       (PERIPH_BASE        +0x00015000)
#define UARTIR_BASE                     (PERIPH_BASE        +0x00017C00)
#define UART0_BASE                      (PERIPH_BASE        +0x00012000)
#define UART1_BASE                      (PERIPH_BASE        +0x00016800)
#define UART2_BASE                      (PERIPH_BASE        +0x00016C00)
#define UART3_BASE                      (PERIPH_BASE        +0x00017000)
#define UART4_BASE                      (PERIPH_BASE        +0x00017400)
#define UART5_BASE                      (PERIPH_BASE        +0x00017800)
#define LPUART0_BASE                    (PERIPH_BASE        +0x00014000)
#define LPUART1_BASE                    (PERIPH_BASE        +0x00014400)
#define SPI0_BASE                       (PERIPH_BASE        +0x00010400)
#define SPI1_BASE                       (PERIPH_BASE        +0x00010800)
#define SPI2_BASE                       (PERIPH_BASE        +0x00014800)
#define SPI3_BASE                       (PERIPH_BASE        +0x00014C00)
#define SPI4_BASE                       (PERIPH_BASE        +0x00016400)
#define U7816_BASE                      (PERIPH_BASE        +0x00011C00)
#define QSPI_BASE                       (PERIPH_BASE        +0x00000800)
#define DMA_BASE                        (PERIPH_BASE        +0x00000400)
#define CRC_BASE                        (PERIPH_BASE        +0x00010000)
#define BT1_BASE                        (PERIPH_BASE        +0x00013000)
#define BT2_BASE                        (PERIPH_BASE        +0x00013044)
#define ET1_BASE                        (PERIPH_BASE        +0x00013090)
#define ET2_BASE                        (PERIPH_BASE        +0x000130B0)
#define ET3_BASE                        (PERIPH_BASE        +0x000130D0)
#define ET4_BASE                        (PERIPH_BASE        +0x000130F0)
#define ETCNT_BASE						(PERIPH_BASE		+0x00013110)
#define BSTIM_BASE                      (PERIPH_BASE        +0x00016000)
#define LPTIM_BASE                      (PERIPH_BASE        +0x00013400)
#define RTC_BASE                        (PERIPH_BASE        +0x00011000)
#define LCD_BASE                        (PERIPH_BASE        +0x00010C00)
#define ADC_BASE                        (PERIPH_BASE        +0x0001FA00)
#define CIC_BASE                        (PERIPH_BASE        +0x00015C00)
#define GPIOA_BASE                      (PERIPH_BASE        +0x00000C00)
#define GPIOB_BASE                      (PERIPH_BASE        +0x00000C40)
#define GPIOC_BASE                      (PERIPH_BASE        +0x00000C80)
#define GPIOD_BASE                      (PERIPH_BASE        +0x00000CC0)
#define GPIOE_BASE                      (PERIPH_BASE        +0x00000D00)
#define GPIOF_BASE                      (PERIPH_BASE        +0x00000D40)
#define GPIOG_BASE                      (PERIPH_BASE        +0x00000D80)
#define GPIOH_BASE                      (PERIPH_BASE        +0x0001FC00)
#define GPIO_BASE                       (PERIPH_BASE        +0x00000DC0)

/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define PMU                             ((PMU_Type          *) PMU_BASE         )
#define DBG                             ((DBG_Type          *) DBG_BASE         )
#define FLS                             ((FLS_Type          *) FLS_BASE         )
#define RMU                             ((RMU_Type          *) RMU_BASE         )
#define IWDT                            ((IWDT_Type         *) IWDT_BASE        )
#define WWDT                            ((WWDT_Type         *) WWDT_BASE        )
#define CMU                             ((CMU_Type          *) CMU_BASE         )
#define CDIF                            ((CDIF_Type         *) CDIF_BASE        )
#define VRTC                            ((VRTC_Type         *) VRTC_BASE        )
#define SVD                             ((SVD_Type          *) SVD_BASE         )
#define AES                             ((AES_Type          *) AES_BASE         )
#define PAE                             ((PAE_Type          *) PAE_BASE         )
#define HASH                            ((HASH_Type         *) HASH_BASE        )
#define RNG                             ((RNG_Type          *) RNG_BASE         )
#define COMP                            ((COMP_Type         *) COMP_BASE        )
#define I2C0                            ((I2C_Type          *) I2C0_BASE        )
#define I2C1                            ((I2C_Type          *) I2C1_BASE        )
#define UARTIR                          ((UARTIR_Type       *) UARTIR_BASE      )
#define UART0                           ((UART_Type         *) UART0_BASE       )
#define UART1                           ((UART_Type         *) UART1_BASE       )
#define UART2                           ((UART_Type         *) UART2_BASE       )
#define UART3                           ((UART_Type         *) UART3_BASE       )
#define UART4                           ((UART_Type         *) UART4_BASE       )
#define UART5                           ((UART_Type         *) UART5_BASE       )
#define LPUART0                         ((LPUART_Type       *) LPUART0_BASE     )
#define LPUART1                         ((LPUART_Type       *) LPUART1_BASE     )
#define SPI0                            ((SPI_Type          *) SPI0_BASE        )
#define SPI1                            ((SPI_Type          *) SPI1_BASE        )
#define SPI2                            ((SPI_Type          *) SPI2_BASE        )
#define SPI3                            ((SPI_Type          *) SPI3_BASE        )
#define SPI4                            ((SPI_Type          *) SPI4_BASE        )
#define U7816                           ((U7816_Type        *) U7816_BASE       )
#define QSPI                            ((QSPI_Type         *) QSPI_BASE        )
#define DMA                             ((DMA_Type          *) DMA_BASE         )
#define CRC                             ((CRC_Type          *) CRC_BASE         )
#define BT1                             ((BT_Type           *) BT1_BASE         )
#define BT2                             ((BT_Type           *) BT2_BASE         )
#define ET1                             ((ET_Type           *) ET1_BASE         )
#define ET2                             ((ET_Type           *) ET2_BASE         )
#define ET3                             ((ET_Type           *) ET3_BASE         )
#define ET4                             ((ET_Type           *) ET4_BASE         )
#define ETCNT							((ETCNT_Type        *) ETCNT_BASE		)
#define BSTIM                           ((BSTIM_Type        *) BSTIM_BASE       )
#define LPTIM                           ((LPTIM_Type        *) LPTIM_BASE       )
#define RTC                             ((RTC_Type          *) RTC_BASE         )
#define LCD                             ((LCD_Type          *) LCD_BASE         )
#define ADC                             ((ADC_Type          *) ADC_BASE         )
#define CIC                             ((CIC_Type          *) CIC_BASE         )
#define GPIOA                           ((GPIO_Type         *) GPIOA_BASE       )
#define GPIOB                           ((GPIO_Type         *) GPIOB_BASE       )
#define GPIOC                           ((GPIO_Type         *) GPIOC_BASE       )
#define GPIOD                           ((GPIO_Type         *) GPIOD_BASE       )
#define GPIOE                           ((GPIO_Type         *) GPIOE_BASE       )
#define GPIOF                           ((GPIO_Type         *) GPIOF_BASE       )
#define GPIOG                           ((GPIO_Type         *) GPIOG_BASE       )
#define GPIOH                           ((GPIOH_Type        *) GPIOH_BASE       )
#define GPIO                            ((GPIO_COMMON_Type  *) GPIO_BASE        )

/* ================================================================================ */
/* ================             Peripheral include                 ================ */
/* ================================================================================ */

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group FM33A0XXEV */
/** @} */ /* End of group Keil */

#ifdef __cplusplus
}
#endif

#endif  /* FM33A0XXEV_H */

